app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Star Wars"], ["rating", "PG"], ["description", "Great Movie"], ["director", "George Lucas"], ["created_at", "2018-10-07 01:07:16.125292"], ["updated_at", "2018-10-07 01:07:16.125292"]]

  def same_director
   @movie = Movie.find(params[:id])
   director = @movie.director
   if director.empty? then
     flash[:notice] = "'#{@movie.title}' has no director info"
     redirect_to movies_path
   else
     @movies = Movie.where(Director: director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'